Rebar can't be placed in a structural family unless its [Material Type] is [Concrete].
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidRebarHostNonConcrete { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidRebarHostNonConcrete As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidRebarHostNonConcrete {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace